<template>
  <section>
    <hr>
    <h4>Яндекс-поиск организаций</h4>
    <br>
    <router-link :to="{name: 'yandex'}">
      Yandex-поиск
    </router-link>
    <br>
    <router-link :to="{name: 'orgList'}">
      Список отобранных организаций
    </router-link>

    <h4>Задание</h4> 

    <div>Исполнитель: Сергей Михайлов <a href="http://psekups.ru/business/resume/__SergeMikhailovVUE_RUS.pdf">Резюме</a></div>
    <div><a href="http://eco.psekups.ru/vue_orgainization/">Результат на сервере </a></div>
    <div>Реализовать Vue-приложение для поиска и просмотра информации об организациях на основе данных из “API Поиска по организациям” Яндекса ( https://tech.yandex.ru/maps/geosearch).</div>
    <div>Ожидаемое поведение:</div>
    <ul>
      <li>при вводе названия организации в текстовое поле, в сервис Яндекса должен отправляться асинхронный запрос на поиск организаций</li>
      <li>при получении ответа от сервиса, необходимо ниже текстового поля отобразить выпадающий список названий найденных организаций (т.н. автокомплит)</li>
      <li>сам модуль автокомплита и выпадающий список необходимо реализовать своими силами, не используя сторонних библиотек </li>
      <li>при нажатии на клавиатуре стрелочек вверх/вниз, должно осуществляться “перемещение” по пунктам выпадающего списка </li>
      <li>при клике в одно из названий, список должен прятаться, а ниже текстового поля должна отобразиться полная информация о выбранной организации (в произвольном формате)</li>
    </ul>
    <div>Верстка не имеет приоритетного значение – можно использовать любые библиотеки  компонентов (учитывая что компонент автокомплита нужно реализовать самому).</div>
    <div>Результат необходимо разместить в публичном репозитории на Github.</div>
  </section>
</template>
